{
  "topics": [
    {
      "title": "Solar Energy",
      "description": "Solar energy is power generated by harnessing the sun's radiation. It's one of the most abundant and sustainable renewable energy sources available.",
      "details": [
        "Solar panels convert sunlight directly into electricity through photovoltaic cells",
        "Solar thermal systems use sunlight to heat water or generate steam for power",
        "Solar energy produces zero direct emissions during operation",
        "The cost of solar panels has decreased by over 80% in the last decade",
        "Solar power can be stored in batteries for use during nighttime or cloudy days"
      ],
      "keywords": ["solar", "sun", "photovoltaic", "pv", "panels", "solor", "sollar", "sollor", "sunlight", "sunny", "solar panel"],
      "common_misspellings": {
        "solor energy": "solar energy",
        "sollar power": "solar power",
        "sun power": "solar power",
        "photovoltaic": ["photovoltaic", "photo voltaic", "photo-voltaic", "pv"],
        "solar pannel": "solar panel",
        "solar cel": "solar cell",
        "photovoltic": "photovoltaic"
      },
      "related_topics": [
        "Energy Storage",
        "Smart Grids",
        "Solar Thermal Systems"
      ],
      "follow_up_questions": [
        "How much do solar panels cost?",
        "How efficient are solar panels?",
        "Can solar panels work in cloudy weather?",
        "What maintenance do solar panels need?"
      ]
    },
    {
      "title": "Wind Power",
      "description": "Wind power harnesses the kinetic energy of moving air to generate electricity through wind turbines.",
      "details": [
        "Wind turbines can be installed both onshore and offshore",
        "Modern wind turbines can power thousands of homes",
        "Wind energy is one of the lowest-cost energy sources available today",
        "Wind farms can be combined with agricultural use of land",
        "Offshore wind farms can generate more consistent power due to steady sea breezes"
      ],
      "keywords": ["wind", "turbine", "windmill", "offshore", "onshore", "winde", "wnd", "windpower", "wind-power"],
      "common_misspellings": {
        "winde power": "wind power",
        "windmil": "windmill",
        "wnd energy": "wind energy",
        "wind turbin": "wind turbine",
        "wind farm": ["wind farm", "windfarm", "wind-farm"],
        "off shore": "offshore",
        "on shore": "onshore"
      },
      "related_topics": [
        "Offshore Wind Farms",
        "Grid Integration",
        "Energy Storage"
      ],
      "follow_up_questions": [
        "How tall are wind turbines?",
        "Why are offshore wind farms more efficient?",
        "What happens when there's no wind?",
        "How long do wind turbines last?"
      ]
    },
    {
      "title": "Hydroelectric Power",
      "description": "Hydroelectric power generates electricity by using the force of falling or flowing water.",
      "details": [
        "Hydropower is one of the oldest forms of renewable energy",
        "Large dams can provide both power and water management benefits",
        "Small-scale hydropower can power remote communities",
        "Pumped storage hydropower helps balance the grid",
        "Hydroelectric plants can quickly adjust output to meet demand"
      ],
      "keywords": ["hydro", "dam", "water", "hydroelectric", "hydropower", "hydro-electric", "hydro power", "water power"],
      "common_misspellings": {
        "hidropower": "hydropower",
        "hydro-power": "hydropower",
        "hydro electric": "hydroelectric",
        "water power": "hydropower",
        "hydro dam": ["hydroelectric dam", "hydro dam", "hydropower dam"],
        "water turbine": "hydro turbine"
      },
      "related_topics": [
        "Pumped Storage",
        "River Management",
        "Small-scale Hydro"
      ],
      "follow_up_questions": [
        "How do hydroelectric dams work?",
        "What's the environmental impact of dams?",
        "Can small streams generate power?",
        "How efficient is hydropower?"
      ]
    },
    {
      "title": "Biomass Energy",
      "description": "Biomass energy comes from burning organic materials like wood, crop waste, or dedicated energy crops.",
      "details": [
        "Biomass can be carbon-neutral if sustainably managed",
        "It can provide baseload power unlike some other renewables",
        "Agricultural waste can be converted into useful energy",
        "Biogas from organic waste can replace natural gas",
        "Modern biomass plants have advanced emission controls"
      ],
      "keywords": ["biomass", "biogas", "organic", "wood", "biofuel", "bio-mass", "bio mass", "bio-fuel"],
      "common_misspellings": {
        "biomass": ["biomass", "bio mass", "bio-mass", "biomas"],
        "biofuel": ["biofuel", "bio fuel", "bio-fuel", "biofuels"],
        "bio gas": "biogas",
        "bio-gass": "biogas",
        "organic fuel": "biofuel"
      },
      "related_topics": [
        "Waste-to-Energy",
        "Agricultural Residues",
        "Biogas Production"
      ],
      "follow_up_questions": [
        "Is biomass truly carbon neutral?",
        "What materials can be used for biomass?",
        "How efficient is biomass energy?",
        "What's the difference between biomass and biogas?"
      ]
    },
    {
      "title": "Geothermal Energy",
      "description": "Geothermal energy taps into the Earth's internal heat for power generation and direct use.",
      "details": [
        "Geothermal power plants provide consistent, reliable power",
        "Heat pumps can use shallow geothermal energy for heating and cooling",
        "Geothermal resources are available worldwide at varying depths",
        "Some regions have natural hot springs and geysers for direct use",
        "Enhanced geothermal systems can work in areas without natural hot spots"
      ],
      "keywords": ["geothermal", "heat", "underground", "volcanic", "hot springs", "geo-thermal", "geo thermal", "earth heat"],
      "common_misspellings": {
        "geothermal": ["geothermal", "geo thermal", "geo-thermal", "geothermic"],
        "ground heat": "geothermal energy",
        "earth heat": "geothermal energy",
        "geo power": "geothermal power",
        "volcanic energy": "geothermal energy",
        "ground source": "geothermal"
      },
      "related_topics": [
        "Heat Pumps",
        "Enhanced Geothermal Systems",
        "District Heating"
      ],
      "follow_up_questions": [
        "How deep are geothermal wells?",
        "Can geothermal energy be used everywhere?",
        "What's the cost of geothermal installation?",
        "How efficient are geothermal heat pumps?"
      ]
    },
    {
      "title": "Energy Storage",
      "description": "Energy storage systems are crucial for managing renewable energy's variable nature and ensuring reliable power supply.",
      "details": [
        "Batteries can store excess solar and wind power",
        "Pumped hydro is the largest form of grid energy storage",
        "Thermal storage can keep solar energy available overnight",
        "Hydrogen can store renewable energy for long periods",
        "Smart grids help balance storage and demand"
      ],
      "keywords": ["storage", "battery", "batteries", "store", "grid", "energy storage", "power storage", "energy bank"],
      "common_misspellings": {
        "energy storage": ["energy storage", "power storage", "energy store", "power store"],
        "battery storage": ["battery storage", "battery store", "batteries storage"],
        "power bank": "energy storage",
        "energy bank": "energy storage",
        "electricity storage": "energy storage"
      },
      "related_topics": [
        "Battery Technology",
        "Grid Integration",
        "Hydrogen Storage"
      ],
      "follow_up_questions": [
        "How long can energy be stored?",
        "What types of batteries are used?",
        "How efficient is energy storage?",
        "What's the cost of energy storage?"
      ]
    }
  ],
  "patterns": [
    {
      "input": "HELLO",
      "responses": [
        "Hi! I'm your renewable energy assistant. Ask about solar, wind, hydropower, geothermal, or biomass!",
        "Hello! Let's discuss clean energy solutions. What would you like to know?",
        "Hi there! Ready to explore renewable energy technologies? Feel free to ask me anything!",
        "Greetings! How can I assist you with your renewable energy questions today?",
        "Hello! Interested in renewable energy? I can help with solar, wind, hydropower, geothermal, and more!",
        "Hey! I'm here to help you with all your renewable energy inquiries. What do you want to learn about?"
      ]
    },
    {
      "input": "TEST",
      "responses": [
        "System verification successful! Ready for energy questions.",
        "Test successful! I'm all set to provide answers about renewable energy.",
        "System check completed. Feel free to ask your energy-related questions now!",
        "All systems operational! What renewable energy topic would you like to explore?"
      ]
    },
    {
      "input": "SOLAR ENERGY",
      "responses": [
        "Solar energy converts sunlight into electricity using photovoltaic cells. Benefits include being renewable, low maintenance, and reducing electricity bills.",
        "Solar panels convert sunlight into electricity through photovoltaic cells, becoming increasingly efficient and cost-effective.",
        "Solar panels use photovoltaic cells to generate clean electricity, lowering utility bills and environmental impact.",
        "Solar systems can be grid-tied/off-grid and combined with battery storage for energy independence."
      ]
    },
    {
      "input": "SOLAR",
      "responses": [
        "Solar energy converts sunlight into electricity using photovoltaic cells. Benefits include being renewable, low maintenance, and reducing electricity bills.",
        "Solar panels convert sunlight into electricity through photovoltaic cells, becoming increasingly efficient and cost-effective.",
        "Solar panels use photovoltaic cells to generate clean electricity, lowering utility bills and environmental impact.",
        "Solar systems can be grid-tied/off-grid and combined with battery storage for energy independence."
      ]
    },
    {
      "input": "WIND",
      "responses": [
        "Wind energy converts kinetic wind energy into electricity via turbines. It's one of the cleanest and most efficient renewable sources."
      ]
    },
    {
      "input": "WIND POWER",
      "responses": [
        "Wind turbines convert wind's kinetic energy into electricity. A single turbine can power ~1,500 homes annually with low environmental impact.",
        "Wind farms (onshore/offshore) generate electricity through turbines, with offshore benefiting from stronger winds.",
        "Wind turbines use blade rotation to generate reliable, increasingly efficient clean energy.",
        "Residential wind turbines provide sustainable energy in windy areas."
      ]
    },
    {
      "input": "BIOMASS ENERGY DETAILS",
      "responses": [
        "Biomass energy uses organic materials like plant/animal waste converted into biofuels, electricity, or heat via combustion/gasification.",
        "Biomass reduces greenhouse emissions using wood, crops, or waste for heating/electricity/transportation fuel.",
        "Biomass manages waste while producing energy (e.g., agricultural waste power generation).",
        "Anaerobic digesters convert biomass into biogas for heating/electricity."
      ]
    },
    {
      "input": "GEOTHERMAL ENERGY DETAILS",
      "responses": [
        "Geothermal energy harnesses Earth's internal heat for electricity (power plants), direct heating, or heat pumps.",
        "Geothermal provides reliable baseload power with low emissions and small land footprint.",
        "Geothermal uses underground heat for clean, inexhaustible electricity/heating.",
        "Geothermal heat pumps offer energy-efficient HVAC alternatives."
      ]
    },
    {
      "input": "HYDROPOWER DETAILS",
      "responses": [
        "Hydropower uses flowing/falling water energy via turbines. Types: run-of-river, reservoir, pumped storage.",
        "Hydropower adjusts to demand, providing base/peak load power globally.",
        "Hydropower generates electricity through dams/rivers sustainably.",
        "Small-scale hydropower minimizes environmental impact in local rivers."
      ]
    },
    {
      "input": "WHAT IS RENEWABLE ENERGY",
      "responses": [
        "Renewable energy comes from replenished natural sources: solar, wind, hydro, geothermal, biomass. Reduces emissions and combats climate change.",
        "Sustainable energy from sunlight, wind, water, geothermal heat. Alternative to finite fossil fuels.",
        "Renewables like solar/wind/hydro provide sustainable energy for the future.",
        "Renewables enhance energy security and reduce fuel imports."
      ]
    },
    {
      "input": "WHAT ARE THE TYPES OF RENEWABLE ENERGY",
      "responses": [
        "Main types: 1. Solar 2. Wind 3. Hydropower 4. Geothermal 5. Biomass. Each has unique benefits/applications.",
        "Five categories: solar, wind, hydro, geothermal, biomass. All use natural processes for energy.",
        "Primary renewables: Solar, Wind, Hydropower, Geothermal, Biomass. Reduce emissions and provide reliable power.",
        "Emerging sources: tidal/wave energy."
      ]
    },
    {
      "input": "HOW DOES SOLAR ENERGY WORK",
      "responses": [
        "Solar panels capture sunlight via photovoltaic cells, converting it into electricity through the photovoltaic effect.",
        "Sunlight excites electrons in solar cells, creating an electric current for power generation.",
        "Solar energy systems convert sunlight to electricity, reducing fossil fuel reliance and lowering bills.",
        "CSP systems use mirrors to focus sunlight, generating heat for electricity production."
      ]
    },
    {
      "input": "WHAT IS WIND ENERGY",
      "responses": [
        "Wind energy converts wind's kinetic energy into electricity using turbines. Efficient, clean, and scalable.",
        "Wind turbines capture wind energy, converting it into mechanical power and then electricity.",
        "Wind farms (onshore/offshore) generate electricity sustainably with minimal environmental impact.",
        "Vertical-axis turbines are effective in urban areas for localized wind energy."
      ]
    },
    {
      "input": "WHAT IS HYDROPOWER",
      "responses": [
        "Hydropower generates electricity from flowing/f falling water via turbines. One of the oldest renewable sources.",
        "Dams or river flow drive turbines to produce electricity, offering flexible energy output.",
        "Hydropower provides base/peak load power and supports grid stability globally.",
        "Run-of-river systems minimize environmental disruption compared to traditional dams."
      ]
    },
    {
      "input": "WHAT ARE THE BENEFITS OF RENEWABLE ENERGY",
      "responses": [
        "Benefits: 1. Reduces emissions 2. Lowers fossil fuel dependence 3. Creates green jobs 4. Promotes energy independence 5. Sustainable resources.",
        "Renewables reduce air pollution, enhance energy security, and support climate goals.",
        "Long-term cost savings, technological innovation, and decentralized energy systems.",
        "Economic growth through investments in clean energy infrastructure."
      ]
    },
    {
      "input": "HOW CAN I USE RENEWABLE ENERGY AT HOME",
      "responses": [
        "Options: 1. Install solar panels 2. Use solar water heaters 3. Small wind turbines 4. Geothermal HVAC 5. Energy-efficient appliances.",
        "Adopt solar panels, battery storage, or community solar programs for clean energy.",
        "Reduce bills and carbon footprint with rooftop solar, smart thermostats, and LED lighting.",
        "Explore tax incentives and net metering for home renewable installations."
      ]
    },
    {
      "input": "WHAT IS THE FUTURE OF RENEWABLE ENERGY",
      "responses": [
        "Future trends: Falling costs, advanced storage, smart grids, and global policy support for renewables.",
        "Renewables expected to dominate energy mix by 2050, driven by tech innovation and climate urgency.",
        "Emerging tech like floating wind farms, perovskite solar cells, and green hydrogen integration.",
        "Decentralized energy systems and AI-driven grid management will revolutionize the sector."
      ]
    },
    {
      "input": "HOW DOES RENEWABLE ENERGY IMPACT THE ENVIRONMENT",
      "responses": [
        "Positives: Reduces emissions, air pollution, and fossil fuel extraction. Challenges: Land use, resource mining, and wildlife impacts.",
        "Renewables lower carbon footprints but require responsible siting and lifecycle management.",
        "Solar/wind have minimal operational emissions; hydropower affects aquatic ecosystems.",
        "Sustainable practices and recycling programs mitigate environmental trade-offs."
      ]
    },
    {
      "input": "WHAT ARE THE CHALLENGES OF RENEWABLE ENERGY",
      "responses": [
        "Challenges: 1. Intermittency 2. High upfront costs 3. Storage limitations 4. Land use conflicts 5. Grid integration.",
        "Intermittent sources require backup systems; infrastructure upgrades are costly.",
        "Public resistance, regulatory hurdles, and supply chain constraints for rare materials.",
        "Balancing energy demand with variable renewable output remains a critical focus."
      ]
    }
  ],
  "regex_patterns": {
    "typo_correction": {
      "common_typos": {
        "SOLAR ENERGY": ["solor", "sollar", "sollor"],
        "WIND": ["winde", "wnd", "wind enery"],
        "HYDROPOWER DETAILS": ["hydro power", "hydro energy"],
        "BIOMASS ENERGY DETAILS": ["biomass enery", "biomasss"],
        "GEOTHERMAL ENERGY DETAILS": ["geotherm", "geo thermal"]
      }
    }
  },
  "case_insensitivity": true,
  "response_templates": {
    "spelling_correction": [
      "I notice you might be asking about {correct_term}. Here's what you need to know: {response}",
      "Let me help you with information about {correct_term}: {response}",
      "While you typed {misspelled_term}, I'll provide information about {correct_term}: {response}",
      "I understand you're interested in {correct_term} (you typed {misspelled_term}). Here's the information: {response}"
    ],
    "multiple_topics": [
      "Your question touches on multiple aspects. Let me break it down:\n\n{responses}",
      "I can help you understand several aspects of this:\n\n{responses}",
      "Here's comprehensive information about your query:\n\n{responses}",
      "Let me explain the different aspects:\n\n{responses}"
    ],
    "not_found": [
      "I'm not quite sure about that specific aspect of renewable energy. Would you like to know about:\n• Solar energy\n• Wind power\n• Hydroelectric power\n• Biomass energy\n• Geothermal energy\n• Energy storage systems?",
      "I don't have specific information about that, but I can tell you about:\n• Solar power (including photovoltaic and thermal)\n• Wind energy (onshore and offshore)\n• Hydropower\n• Biomass energy\n• Geothermal systems\n• Energy storage solutions",
      "While I'm not sure about that specific query, I can provide information about any of these renewable energy topics:\n• Solar energy systems\n• Wind power technology\n• Hydroelectric power generation\n• Biomass energy solutions\n• Geothermal power\n• Energy storage methods"
    ],
    "clarification": [
      "Could you please specify which aspect of {topic} you'd like to learn about?",
      "I can tell you about several aspects of {topic}. What interests you most?",
      "There's a lot to cover about {topic}. What specific information would be most helpful?"
    ]
  },
  "query_handlers": {
    "general_inquiries": {
      "what is renewable energy": {
        "response": "Renewable energy comes from naturally replenishing sources such as:\n• Solar (sunlight)\n• Wind\n• Hydropower (water)\n• Geothermal (earth's heat)\n• Biomass (organic matter)\n\nThese energy sources are sustainable and help combat climate change by reducing greenhouse gas emissions.",
        "follow_up_suggestions": [
          "Would you like to learn more about a specific type of renewable energy?",
          "Are you interested in how to use renewable energy at home?",
          "Would you like to know about the benefits of renewable energy?"
        ]
      },
      "benefits": {
        "response": "Renewable energy offers numerous benefits:\n• Zero or low emissions\n• Infinite resource availability\n• Reduced dependency on fossil fuels\n• Lower long-term costs\n• Job creation in green sectors\n• Energy independence\n• Improved public health through reduced pollution",
        "follow_up_suggestions": [
          "Would you like to know more about a specific benefit?",
          "Are you interested in implementing renewable energy solutions?",
          "Would you like to learn about government incentives for renewable energy?"
        ]
      },
      "comparison": {
        "response": "Different renewable energy sources have unique advantages:\n• Solar: Abundant, works anywhere with sunlight\n• Wind: Very cost-effective, works day and night\n• Hydro: Reliable, provides consistent power\n• Biomass: Can use waste materials, provides steady output\n• Geothermal: Constant power, very reliable\n• Storage: Essential for managing variable sources",
        "follow_up_suggestions": [
          "Would you like to compare specific types of renewable energy?",
          "Are you interested in which type might be best for your needs?",
          "Would you like to know about hybrid renewable systems?"
        ]
      }
    }
  }
}